MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFG144/mcu.h
extern volatile __U1STAbits_t U1STAbits __asm__ ("U1STA") __attribute__((section("sfrs"), address(0xBF822010)));
#define UABSTA UABSTA
extern volatile uint32_t   UABSTA __attribute__((section("sfrs"), address(0xBF822010)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __UABSTAbits_t;
extern volatile __UABSTAbits_t UABSTAbits __asm__ ("UABSTA") __attribute__((section("sfrs"), address(0xBF822010)));
extern volatile uint32_t        U1STACLR __attribute__((section("sfrs"),address(0xBF822014)));
extern volatile uint32_t        UABSTACLR __attribute__((section("sfrs"),address(0xBF822014)));
extern volatile uint32_t        U1STASET __attribute__((section("sfrs"),address(0xBF822018)));
extern volatile uint32_t        UABSTASET __attribute__((section("sfrs"),address(0xBF822018)));
extern volatile uint32_t        U1STAINV __attribute__((section("sfrs"),address(0xBF82201C)));
extern volatile uint32_t        UABSTAINV __attribute__((section("sfrs"),address(0xBF82201C)));
#define U1TXREG U1TXREG
extern volatile uint32_t   U1TXREG __attribute__((section("sfrs"), address(0xBF822020)));
#define UABTXREG UABTXREG
extern volatile uint32_t   UABTXREG __attribute__((section("sfrs"), address(0xBF822020)));
#define U1RXREG U1RXREG
extern volatile uint32_t   U1RXREG __attribute__((section("sfrs"), address(0xBF822030)));
#define UABRXREG UABRXREG
extern volatile uint32_t   UABRXREG __attribute__((section("sfrs"), address(0xBF822030)));
#define U1BRG U1BRG
extern volatile uint32_t   U1BRG __attribute__((section("sfrs"), address(0xBF822040)));
#define UABBRG UABBRG
extern volatile uint32_t   UABBRG __attribute__((section("sfrs"), address(0xBF822040)));
extern volatile uint32_t        U1BRGCLR __attribute__((section("sfrs"),address(0xBF822044)));
extern volatile uint32_t        UABBRGCLR __attribute__((section("sfrs"),address(0xBF822044)));
extern volatile uint32_t        U1BRGSET __attribute__((section("sfrs"),address(0xBF822048)));
extern volatile uint32_t        UABBRGSET __attribute__((section("sfrs"),address(0xBF822048)));
extern volatile uint32_t        U1BRGINV __attribute__((section("sfrs"),address(0xBF82204C)));
extern volatile uint32_t        UABBRGINV __attribute__((section("sfrs"),address(0xBF82204C)));
#define U2MODE U2MODE
extern volatile uint32_t   U2MODE __attribute__((section("sfrs"), address(0xBF822200)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U2MODEbits_t;
extern volatile __U2MODEbits_t U2MODEbits __asm__ ("U2MODE") __attribute__((section("sfrs"), address(0xBF822200)));
#define UCDMODE UCDMODE
extern volatile uint32_t   UCDMODE __attribute__((section("sfrs"), address(0xBF822200)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __UCDMODEbits_t;
extern volatile __UCDMODEbits_t UCDMODEbits __asm__ ("UCDMODE") __attribute__((section("sfrs"), address(0xBF822200)));
extern volatile uint32_t        U2MODECLR __attribute__((section("sfrs"),address(0xBF822204)));
extern volatile uint32_t        UCDMODECLR __attribute__((section("sfrs"),address(0xBF822204)));
extern volatile uint32_t        U2MODESET __attribute__((section("sfrs"),address(0xBF822208)));
extern volatile uint32_t        UCDMODESET __attribute__((section("sfrs"),address(0xBF822208)));
extern volatile uint32_t        U2MODEINV __attribute__((section("sfrs"),address(0xBF82220C)));
extern volatile uint32_t        UCDMODEINV __attribute__((section("sfrs"),address(0xBF82220C)));
#define U2STA U2STA
extern volatile uint32_t   U2STA __attribute__((section("sfrs"), address(0xBF822210)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U2STAbits_t;
extern volatile __U2STAbits_t U2STAbits __asm__ ("U2STA") __attribute__((section("sfrs"), address(0xBF822210)));
#define UCDSTA UCDSTA
extern volatile uint32_t   UCDSTA __attribute__((section("sfrs"), address(0xBF822210)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __UCDSTAbits_t;
extern volatile __UCDSTAbits_t UCDSTAbits __asm__ ("UCDSTA") __attribute__((section("sfrs"), address(0xBF822210)));
extern volatile uint32_t        U2STACLR __attribute__((section("sfrs"),address(0xBF822214)));
extern volatile uint32_t        UCDSTACLR __attribute__((section("sfrs"),address(0xBF822214)));
extern volatile uint32_t        U2STASET __attribute__((section("sfrs"),address(0xBF822218)));
extern volatile uint32_t        UCDSTASET __attribute__((section("sfrs"),address(0xBF822218)));
extern volatile uint32_t        U2STAINV __attribute__((section("sfrs"),address(0xBF82221C)));
extern volatile uint32_t        UCDSTAINV __attribute__((section("sfrs"),address(0xBF82221C)));
#define U2TXREG U2TXREG
extern volatile uint32_t   U2TXREG __attribute__((section("sfrs"), address(0xBF822220)));
#define UCDTXREG UCDTXREG
extern volatile uint32_t   UCDTXREG __attribute__((section("sfrs"), address(0xBF822220)));
#define U2RXREG U2RXREG
extern volatile uint32_t   U2RXREG __attribute__((section("sfrs"), address(0xBF822230)));
#define UCDRXREG UCDRXREG
extern volatile uint32_t   UCDRXREG __attribute__((section("sfrs"), address(0xBF822230)));
#define U2BRG U2BRG
extern volatile uint32_t   U2BRG __attribute__((section("sfrs"), address(0xBF822240)));
#define UCDBRG UCDBRG
extern volatile uint32_t   UCDBRG __attribute__((section("sfrs"), address(0xBF822240)));
extern volatile uint32_t        U2BRGCLR __attribute__((section("sfrs"),address(0xBF822244)));
extern volatile uint32_t        UCDBRGCLR __attribute__((section("sfrs"),address(0xBF822244)));
extern volatile uint32_t        U2BRGSET __attribute__((section("sfrs"),address(0xBF822248)));
extern volatile uint32_t        UCDBRGSET __attribute__((section("sfrs"),address(0xBF822248)));
extern volatile uint32_t        U2BRGINV __attribute__((section("sfrs"),address(0xBF82224C)));
extern volatile uint32_t        UCDBRGINV __attribute__((section("sfrs"),address(0xBF82224C)));
#define U3MODE U3MODE
extern volatile uint32_t   U3MODE __attribute__((section("sfrs"), address(0xBF822400)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U3MODEbits_t;
