MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFG144/mcu.h
extern volatile __ODCJbits_t ODCJbits __asm__ ("ODCJ") __attribute__((section("sfrs"), address(0xBF860840)));
extern volatile uint32_t        ODCJCLR __attribute__((section("sfrs"),address(0xBF860844)));
extern volatile uint32_t        ODCJSET __attribute__((section("sfrs"),address(0xBF860848)));
extern volatile uint32_t        ODCJINV __attribute__((section("sfrs"),address(0xBF86084C)));
#define CNPUJ CNPUJ
extern volatile uint32_t   CNPUJ __attribute__((section("sfrs"), address(0xBF860850)));
typedef union {
  struct {
    uint32_t CNPUJ0:1;
    uint32_t CNPUJ1:1;
    uint32_t CNPUJ2:1;
    uint32_t CNPUJ3:1;
    uint32_t CNPUJ4:1;
    uint32_t CNPUJ5:1;
    uint32_t CNPUJ6:1;
    uint32_t CNPUJ7:1;
    uint32_t CNPUJ8:1;
    uint32_t CNPUJ9:1;
    uint32_t CNPUJ10:1;
    uint32_t CNPUJ11:1;
    uint32_t CNPUJ12:1;
    uint32_t CNPUJ13:1;
    uint32_t CNPUJ14:1;
    uint32_t CNPUJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUJbits_t;
extern volatile __CNPUJbits_t CNPUJbits __asm__ ("CNPUJ") __attribute__((section("sfrs"), address(0xBF860850)));
extern volatile uint32_t        CNPUJCLR __attribute__((section("sfrs"),address(0xBF860854)));
extern volatile uint32_t        CNPUJSET __attribute__((section("sfrs"),address(0xBF860858)));
extern volatile uint32_t        CNPUJINV __attribute__((section("sfrs"),address(0xBF86085C)));
#define CNPDJ CNPDJ
extern volatile uint32_t   CNPDJ __attribute__((section("sfrs"), address(0xBF860860)));
typedef union {
  struct {
    uint32_t CNPDJ0:1;
    uint32_t CNPDJ1:1;
    uint32_t CNPDJ2:1;
    uint32_t CNPDJ3:1;
    uint32_t CNPDJ4:1;
    uint32_t CNPDJ5:1;
    uint32_t CNPDJ6:1;
    uint32_t CNPDJ7:1;
    uint32_t CNPDJ8:1;
    uint32_t CNPDJ9:1;
    uint32_t CNPDJ10:1;
    uint32_t CNPDJ11:1;
    uint32_t CNPDJ12:1;
    uint32_t CNPDJ13:1;
    uint32_t CNPDJ14:1;
    uint32_t CNPDJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDJbits_t;
extern volatile __CNPDJbits_t CNPDJbits __asm__ ("CNPDJ") __attribute__((section("sfrs"), address(0xBF860860)));
extern volatile uint32_t        CNPDJCLR __attribute__((section("sfrs"),address(0xBF860864)));
extern volatile uint32_t        CNPDJSET __attribute__((section("sfrs"),address(0xBF860868)));
extern volatile uint32_t        CNPDJINV __attribute__((section("sfrs"),address(0xBF86086C)));
#define CNCONJ CNCONJ
extern volatile uint32_t   CNCONJ __attribute__((section("sfrs"), address(0xBF860870)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONJbits_t;
extern volatile __CNCONJbits_t CNCONJbits __asm__ ("CNCONJ") __attribute__((section("sfrs"), address(0xBF860870)));
extern volatile uint32_t        CNCONJCLR __attribute__((section("sfrs"),address(0xBF860874)));
extern volatile uint32_t        CNCONJSET __attribute__((section("sfrs"),address(0xBF860878)));
extern volatile uint32_t        CNCONJINV __attribute__((section("sfrs"),address(0xBF86087C)));
#define CNENJ CNENJ
extern volatile uint32_t   CNENJ __attribute__((section("sfrs"), address(0xBF860880)));
typedef union {
  struct {
    uint32_t CNIEJ0:1;
    uint32_t CNIEJ1:1;
    uint32_t CNIEJ2:1;
    uint32_t CNIEJ3:1;
    uint32_t CNIEJ4:1;
    uint32_t CNIEJ5:1;
    uint32_t CNIEJ6:1;
    uint32_t CNIEJ7:1;
    uint32_t CNIEJ8:1;
    uint32_t CNIEJ9:1;
    uint32_t CNIEJ10:1;
    uint32_t CNIEJ11:1;
    uint32_t CNIEJ12:1;
    uint32_t CNIEJ13:1;
    uint32_t CNIEJ14:1;
    uint32_t CNIEJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENJbits_t;
extern volatile __CNENJbits_t CNENJbits __asm__ ("CNENJ") __attribute__((section("sfrs"), address(0xBF860880)));
extern volatile uint32_t        CNENJCLR __attribute__((section("sfrs"),address(0xBF860884)));
extern volatile uint32_t        CNENJSET __attribute__((section("sfrs"),address(0xBF860888)));
extern volatile uint32_t        CNENJINV __attribute__((section("sfrs"),address(0xBF86088C)));
#define CNSTATJ CNSTATJ
extern volatile uint32_t   CNSTATJ __attribute__((section("sfrs"), address(0xBF860890)));
typedef union {
  struct {
    uint32_t CNSTATJ0:1;
    uint32_t CNSTATJ1:1;
    uint32_t CNSTATJ2:1;
    uint32_t CNSTATJ3:1;
    uint32_t CNSTATJ4:1;
    uint32_t CNSTATJ5:1;
    uint32_t CNSTATJ6:1;
    uint32_t CNSTATJ7:1;
    uint32_t CNSTATJ8:1;
    uint32_t CNSTATJ9:1;
    uint32_t CNSTATJ10:1;
    uint32_t CNSTATJ11:1;
    uint32_t CNSTATJ12:1;
    uint32_t CNSTATJ13:1;
    uint32_t CNSTATJ14:1;
    uint32_t CNSTATJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATJbits_t;
extern volatile __CNSTATJbits_t CNSTATJbits __asm__ ("CNSTATJ") __attribute__((section("sfrs"), address(0xBF860890)));
extern volatile uint32_t        CNSTATJCLR __attribute__((section("sfrs"),address(0xBF860894)));
extern volatile uint32_t        CNSTATJSET __attribute__((section("sfrs"),address(0xBF860898)));
extern volatile uint32_t        CNSTATJINV __attribute__((section("sfrs"),address(0xBF86089C)));
#define CNNEJ CNNEJ
extern volatile uint32_t   CNNEJ __attribute__((section("sfrs"), address(0xBF8608A0)));
typedef struct {
  uint32_t CNNEJ0:1;
  uint32_t CNNEJ1:1;
  uint32_t CNNEJ2:1;
  uint32_t CNNEJ3:1;
  uint32_t CNNEJ4:1;
  uint32_t CNNEJ5:1;
  uint32_t CNNEJ6:1;
  uint32_t CNNEJ7:1;
  uint32_t CNNEJ8:1;
  uint32_t CNNEJ9:1;
  uint32_t CNNEJ10:1;
  uint32_t CNNEJ11:1;
  uint32_t CNNEJ12:1;
  uint32_t CNNEJ13:1;
  uint32_t CNNEJ14:1;
  uint32_t CNNEJ15:1;
} __CNNEJbits_t;
extern volatile __CNNEJbits_t CNNEJbits __asm__ ("CNNEJ") __attribute__((section("sfrs"), address(0xBF8608A0)));
extern volatile uint32_t        CNNEJCLR __attribute__((section("sfrs"),address(0xBF8608A4)));
extern volatile uint32_t        CNNEJSET __attribute__((section("sfrs"),address(0xBF8608A8)));
extern volatile uint32_t        CNNEJINV __attribute__((section("sfrs"),address(0xBF8608AC)));
#define CNFJ CNFJ
extern volatile uint32_t   CNFJ __attribute__((section("sfrs"), address(0xBF8608B0)));
typedef struct {
  uint32_t CNFJ0:1;
  uint32_t CNFJ1:1;
  uint32_t CNFJ2:1;
  uint32_t CNFJ3:1;
  uint32_t CNFJ4:1;
  uint32_t CNFJ5:1;
  uint32_t CNFJ6:1;
  uint32_t CNFJ7:1;
  uint32_t CNFJ8:1;
  uint32_t CNFJ9:1;
  uint32_t CNFJ10:1;
  uint32_t CNFJ11:1;
  uint32_t CNFJ12:1;
  uint32_t CNFJ13:1;
  uint32_t CNFJ14:1;
  uint32_t CNFJ15:1;
} __CNFJbits_t;
extern volatile __CNFJbits_t CNFJbits __asm__ ("CNFJ") __attribute__((section("sfrs"), address(0xBF8608B0)));
extern volatile uint32_t        CNFJCLR __attribute__((section("sfrs"),address(0xBF8608B4)));
extern volatile uint32_t        CNFJSET __attribute__((section("sfrs"),address(0xBF8608B8)));
extern volatile uint32_t        CNFJINV __attribute__((section("sfrs"),address(0xBF8608BC)));
#define TRISK TRISK
extern volatile uint32_t   TRISK __attribute__((section("sfrs"), address(0xBF860910)));
typedef union {
  struct {
    uint32_t TRISK0:1;
    uint32_t TRISK1:1;
    uint32_t TRISK2:1;
    uint32_t TRISK3:1;
    uint32_t TRISK4:1;
    uint32_t TRISK5:1;
    uint32_t TRISK6:1;
    uint32_t TRISK7:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISKbits_t;
