MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFG144/mcu.h
extern volatile __CNNEKbits_t CNNEKbits __asm__ ("CNNEK") __attribute__((section("sfrs"), address(0xBF8609A0)));
extern volatile uint32_t        CNNEKCLR __attribute__((section("sfrs"),address(0xBF8609A4)));
extern volatile uint32_t        CNNEKSET __attribute__((section("sfrs"),address(0xBF8609A8)));
extern volatile uint32_t        CNNEKINV __attribute__((section("sfrs"),address(0xBF8609AC)));
#define CNFK CNFK
extern volatile uint32_t   CNFK __attribute__((section("sfrs"), address(0xBF8609B0)));
typedef struct {
  uint32_t CNFK0:1;
  uint32_t CNFK1:1;
  uint32_t CNFK2:1;
  uint32_t CNFK3:1;
  uint32_t CNFK4:1;
  uint32_t CNFK5:1;
  uint32_t CNFK6:1;
  uint32_t CNFK7:1;
  uint32_t CNFK8:1;
  uint32_t CNFK9:1;
  uint32_t CNFK10:1;
  uint32_t CNFK11:1;
  uint32_t CNFK12:1;
  uint32_t CNFK13:1;
  uint32_t CNFK14:1;
  uint32_t CNFK15:1;
} __CNFKbits_t;
extern volatile __CNFKbits_t CNFKbits __asm__ ("CNFK") __attribute__((section("sfrs"), address(0xBF8609B0)));
extern volatile uint32_t        CNFKCLR __attribute__((section("sfrs"),address(0xBF8609B4)));
extern volatile uint32_t        CNFKSET __attribute__((section("sfrs"),address(0xBF8609B8)));
extern volatile uint32_t        CNFKINV __attribute__((section("sfrs"),address(0xBF8609BC)));
#define ETHCON1 ETHCON1
extern volatile uint32_t   ETHCON1 __attribute__((section("sfrs"), address(0xBF882000)));
typedef union {
  struct {
    uint32_t BUFCDEC:1;
    uint32_t :3;
    uint32_t MANFC:1;
    uint32_t :2;
    uint32_t AUTOFC:1;
    uint32_t RXEN:1;
    uint32_t TXRTS:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t PTV:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHCON1bits_t;
extern volatile __ETHCON1bits_t ETHCON1bits __asm__ ("ETHCON1") __attribute__((section("sfrs"), address(0xBF882000)));
extern volatile uint32_t        ETHCON1CLR __attribute__((section("sfrs"),address(0xBF882004)));
extern volatile uint32_t        ETHCON1SET __attribute__((section("sfrs"),address(0xBF882008)));
extern volatile uint32_t        ETHCON1INV __attribute__((section("sfrs"),address(0xBF88200C)));
#define ETHCON2 ETHCON2
extern volatile uint32_t   ETHCON2 __attribute__((section("sfrs"), address(0xBF882010)));
typedef union {
  struct {
    uint32_t :4;
    uint32_t RXBUF_SZ:7;
  };
  struct {
    uint32_t w:32;
  };
} __ETHCON2bits_t;
extern volatile __ETHCON2bits_t ETHCON2bits __asm__ ("ETHCON2") __attribute__((section("sfrs"), address(0xBF882010)));
extern volatile uint32_t        ETHCON2CLR __attribute__((section("sfrs"),address(0xBF882014)));
extern volatile uint32_t        ETHCON2SET __attribute__((section("sfrs"),address(0xBF882018)));
extern volatile uint32_t        ETHCON2INV __attribute__((section("sfrs"),address(0xBF88201C)));
#define ETHTXST ETHTXST
extern volatile uint32_t   ETHTXST __attribute__((section("sfrs"), address(0xBF882020)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t TXSTADDR:30;
  };
  struct {
    uint32_t w:32;
  };
} __ETHTXSTbits_t;
extern volatile __ETHTXSTbits_t ETHTXSTbits __asm__ ("ETHTXST") __attribute__((section("sfrs"), address(0xBF882020)));
extern volatile uint32_t        ETHTXSTCLR __attribute__((section("sfrs"),address(0xBF882024)));
extern volatile uint32_t        ETHTXSTSET __attribute__((section("sfrs"),address(0xBF882028)));
extern volatile uint32_t        ETHTXSTINV __attribute__((section("sfrs"),address(0xBF88202C)));
#define ETHRXST ETHRXST
extern volatile uint32_t   ETHRXST __attribute__((section("sfrs"), address(0xBF882030)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t RXSTADDR:30;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXSTbits_t;
extern volatile __ETHRXSTbits_t ETHRXSTbits __asm__ ("ETHRXST") __attribute__((section("sfrs"), address(0xBF882030)));
extern volatile uint32_t        ETHRXSTCLR __attribute__((section("sfrs"),address(0xBF882034)));
extern volatile uint32_t        ETHRXSTSET __attribute__((section("sfrs"),address(0xBF882038)));
extern volatile uint32_t        ETHRXSTINV __attribute__((section("sfrs"),address(0xBF88203C)));
#define ETHHT0 ETHHT0
extern volatile uint32_t   ETHHT0 __attribute__((section("sfrs"), address(0xBF882040)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t HTLOWER:32;
  };
} __ETHHT0bits_t;
extern volatile __ETHHT0bits_t ETHHT0bits __asm__ ("ETHHT0") __attribute__((section("sfrs"), address(0xBF882040)));
extern volatile uint32_t        ETHHT0CLR __attribute__((section("sfrs"),address(0xBF882044)));
extern volatile uint32_t        ETHHT0SET __attribute__((section("sfrs"),address(0xBF882048)));
extern volatile uint32_t        ETHHT0INV __attribute__((section("sfrs"),address(0xBF88204C)));
#define ETHHT1 ETHHT1
extern volatile uint32_t   ETHHT1 __attribute__((section("sfrs"), address(0xBF882050)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t HTUPPER:32;
  };
} __ETHHT1bits_t;
extern volatile __ETHHT1bits_t ETHHT1bits __asm__ ("ETHHT1") __attribute__((section("sfrs"), address(0xBF882050)));
extern volatile uint32_t        ETHHT1CLR __attribute__((section("sfrs"),address(0xBF882054)));
extern volatile uint32_t        ETHHT1SET __attribute__((section("sfrs"),address(0xBF882058)));
extern volatile uint32_t        ETHHT1INV __attribute__((section("sfrs"),address(0xBF88205C)));
#define ETHPMM0 ETHPMM0
extern volatile uint32_t   ETHPMM0 __attribute__((section("sfrs"), address(0xBF882060)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t PMMLOWER:32;
  };
} __ETHPMM0bits_t;
extern volatile __ETHPMM0bits_t ETHPMM0bits __asm__ ("ETHPMM0") __attribute__((section("sfrs"), address(0xBF882060)));
extern volatile uint32_t        ETHPMM0CLR __attribute__((section("sfrs"),address(0xBF882064)));
extern volatile uint32_t        ETHPMM0SET __attribute__((section("sfrs"),address(0xBF882068)));
extern volatile uint32_t        ETHPMM0INV __attribute__((section("sfrs"),address(0xBF88206C)));
#define ETHPMM1 ETHPMM1
extern volatile uint32_t   ETHPMM1 __attribute__((section("sfrs"), address(0xBF882070)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t PMMUPPER:32;
  };
} __ETHPMM1bits_t;
extern volatile __ETHPMM1bits_t ETHPMM1bits __asm__ ("ETHPMM1") __attribute__((section("sfrs"), address(0xBF882070)));
extern volatile uint32_t        ETHPMM1CLR __attribute__((section("sfrs"),address(0xBF882074)));
extern volatile uint32_t        ETHPMM1SET __attribute__((section("sfrs"),address(0xBF882078)));
extern volatile uint32_t        ETHPMM1INV __attribute__((section("sfrs"),address(0xBF88207C)));
#define ETHPMCS ETHPMCS
extern volatile uint32_t   ETHPMCS __attribute__((section("sfrs"), address(0xBF882080)));
typedef union {
  struct {
    uint32_t PMCS:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHPMCSbits_t;
extern volatile __ETHPMCSbits_t ETHPMCSbits __asm__ ("ETHPMCS") __attribute__((section("sfrs"), address(0xBF882080)));
extern volatile uint32_t        ETHPMCSCLR __attribute__((section("sfrs"),address(0xBF882084)));
extern volatile uint32_t        ETHPMCSSET __attribute__((section("sfrs"),address(0xBF882088)));
extern volatile uint32_t        ETHPMCSINV __attribute__((section("sfrs"),address(0xBF88208C)));
#define ETHPMO ETHPMO
extern volatile uint32_t   ETHPMO __attribute__((section("sfrs"), address(0xBF882090)));
typedef union {
  struct {
    uint32_t PMO:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHPMObits_t;
extern volatile __ETHPMObits_t ETHPMObits __asm__ ("ETHPMO") __attribute__((section("sfrs"), address(0xBF882090)));
extern volatile uint32_t        ETHPMOCLR __attribute__((section("sfrs"),address(0xBF882094)));
extern volatile uint32_t        ETHPMOSET __attribute__((section("sfrs"),address(0xBF882098)));
extern volatile uint32_t        ETHPMOINV __attribute__((section("sfrs"),address(0xBF88209C)));
#define ETHRXFC ETHRXFC
extern volatile uint32_t   ETHRXFC __attribute__((section("sfrs"), address(0xBF8820A0)));
typedef union {
  struct {
    uint32_t BCEN:1;
    uint32_t MCEN:1;
    uint32_t NOTMEEN:1;
    uint32_t UCEN:1;
    uint32_t RUNTEN:1;
    uint32_t RUNTERREN:1;
    uint32_t CRCOKEN:1;
    uint32_t CRCERREN:1;
    uint32_t PMMODE:4;
    uint32_t NOTPM:1;
    uint32_t :1;
    uint32_t MPEN:1;
    uint32_t HTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXFCbits_t;
extern volatile __ETHRXFCbits_t ETHRXFCbits __asm__ ("ETHRXFC") __attribute__((section("sfrs"), address(0xBF8820A0)));
extern volatile uint32_t        ETHRXFCCLR __attribute__((section("sfrs"),address(0xBF8820A4)));
extern volatile uint32_t        ETHRXFCSET __attribute__((section("sfrs"),address(0xBF8820A8)));
extern volatile uint32_t        ETHRXFCINV __attribute__((section("sfrs"),address(0xBF8820AC)));
#define ETHRXWM ETHRXWM
extern volatile uint32_t   ETHRXWM __attribute__((section("sfrs"), address(0xBF8820B0)));
typedef union {
  struct {
    uint32_t RXEWM:8;
    uint32_t :8;
    uint32_t RXFWM:8;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXWMbits_t;
extern volatile __ETHRXWMbits_t ETHRXWMbits __asm__ ("ETHRXWM") __attribute__((section("sfrs"), address(0xBF8820B0)));
extern volatile uint32_t        ETHRXWMCLR __attribute__((section("sfrs"),address(0xBF8820B4)));
extern volatile uint32_t        ETHRXWMSET __attribute__((section("sfrs"),address(0xBF8820B8)));
extern volatile uint32_t        ETHRXWMINV __attribute__((section("sfrs"),address(0xBF8820BC)));
#define ETHIEN ETHIEN
extern volatile uint32_t   ETHIEN __attribute__((section("sfrs"), address(0xBF8820C0)));
typedef union {
  struct {
    uint32_t RXOVFLWIE:1;
    uint32_t RXBUFNAIE:1;
    uint32_t TXABORTIE:1;
    uint32_t TXDONEIE:1;
    uint32_t :1;
    uint32_t RXACTIE:1;
    uint32_t PKTPENDIE:1;
    uint32_t RXDONEIE:1;
    uint32_t FWMARKIE:1;
    uint32_t EWMARKIE:1;
    uint32_t :3;
    uint32_t RXBUSEIE:1;
    uint32_t TXBUSEIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __ETHIENbits_t;
extern volatile __ETHIENbits_t ETHIENbits __asm__ ("ETHIEN") __attribute__((section("sfrs"), address(0xBF8820C0)));
extern volatile uint32_t        ETHIENCLR __attribute__((section("sfrs"),address(0xBF8820C4)));
extern volatile uint32_t        ETHIENSET __attribute__((section("sfrs"),address(0xBF8820C8)));
extern volatile uint32_t        ETHIENINV __attribute__((section("sfrs"),address(0xBF8820CC)));
#define ETHIRQ ETHIRQ
extern volatile uint32_t   ETHIRQ __attribute__((section("sfrs"), address(0xBF8820D0)));
typedef union {
  struct {
    uint32_t RXOVFLW:1;
    uint32_t RXBUFNA:1;
    uint32_t TXABORT:1;
    uint32_t TXDONE:1;
    uint32_t :1;
    uint32_t RXACT:1;
    uint32_t PKTPEND:1;
    uint32_t RXDONE:1;
    uint32_t FWMARK:1;
    uint32_t EWMARK:1;
    uint32_t :3;
    uint32_t RXBUSE:1;
    uint32_t TXBUSE:1;
  };
  struct {
    uint32_t w:32;
  };
} __ETHIRQbits_t;
extern volatile __ETHIRQbits_t ETHIRQbits __asm__ ("ETHIRQ") __attribute__((section("sfrs"), address(0xBF8820D0)));
extern volatile uint32_t        ETHIRQCLR __attribute__((section("sfrs"),address(0xBF8820D4)));
extern volatile uint32_t        ETHIRQSET __attribute__((section("sfrs"),address(0xBF8820D8)));
extern volatile uint32_t        ETHIRQINV __attribute__((section("sfrs"),address(0xBF8820DC)));
#define ETHSTAT ETHSTAT
extern volatile uint32_t   ETHSTAT __attribute__((section("sfrs"), address(0xBF8820E0)));
typedef union {
  struct {
    uint32_t :5;
    uint32_t RXBUSY:1;
    uint32_t TXBUSY:1;
    uint32_t BUSY:1;
    uint32_t :8;
    uint32_t BUFCNT:8;
  };
  struct {
    uint32_t :7;
    uint32_t ETHBUSY:1;
  };
  struct {
    uint32_t w:32;
  };
} __ETHSTATbits_t;
extern volatile __ETHSTATbits_t ETHSTATbits __asm__ ("ETHSTAT") __attribute__((section("sfrs"), address(0xBF8820E0)));
extern volatile uint32_t        ETHSTATCLR __attribute__((section("sfrs"),address(0xBF8820E4)));
extern volatile uint32_t        ETHSTATSET __attribute__((section("sfrs"),address(0xBF8820E8)));
extern volatile uint32_t        ETHSTATINV __attribute__((section("sfrs"),address(0xBF8820EC)));
#define ETHRXOVFLOW ETHRXOVFLOW
extern volatile uint32_t   ETHRXOVFLOW __attribute__((section("sfrs"), address(0xBF882100)));
typedef union {
  struct {
    uint32_t RXOVFLWCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXOVFLOWbits_t;
